
counterparty_category = {
    '餐饮日用': {
        '超市菜场': [
            '*玉芳',
            '7-11(SEB)',
            'A  沿河小良',
            'A  小龙哥、',
            'wzg',
            'zhang',
            '万通五金百货',
            '万通果蔬大卖场',
            '万通果蔬大卖场京旺家园店',
            '世纪华联草场地店',
            '主食厨房',
            '冀喜荣',
            '北京便利蜂连锁商业有限公司',
            '华润超级市场有限公司',
            '华联生活超市京旺三区店',
            '叁金叁京旺店啤酒',
            '友宝售货机',
            '嘉华超市',
            '宋国强',
            '宏',
            '宗海',
            '市场牛羊肉批发加工羊肉串',
            '平安快乐',
            '张',
            '快客便利店',
            '快客便利店国际电子城',
            '您好经典主食欢迎您',
            '我又改微信名啦',
            '李玉荣',
            '水果哥',
            '水果店',
            '沧州盐百',
            '沧州盐百购物广场有限公司',
            '海峰',
            '爱在明天',
            '玲玲',
            '福甜生鲜超市(京旺店)',
            '红薯地瓜坊',
            '胜利',
            '薛欣妍',
            '许浩',
            '谊品生鲜',
            '贾宝俊',
            '超市购物',
            '进口食品超市',
            '郭',
            '高荣玉',
            '魏志永',
            '鲸落',
            '麦果果',
            '👕王振海👕',
        ],
        '餐饮': [
            'luckincoffee瑞幸咖啡',
            '主食厨房',
            '乐家老铺食品旗舰店',
            '二愣子手擀面',
            '健力源-360餐厅',
            '北京盒马',
            '北京老诚一锅',
            '小舅',
            '山东大饼',
            '川渝香锅居东辛店店',
            '快客早餐国际电子城',
            '早阳鲜包北京朝阳酒仙桥路店',
            '晋碗香',
            '森，森，森夜🌹',
            '海峰',
            '溢香阁',
            '红薯地瓜坊',
            '老店煎饼',
            '芳芳',
            '草场地二愣子手擀面',
            '西北汉子（京旺店）',
            '郑家老式熏鸡',
            '酒仙桥路7号黎家早阳鲜包店',
            '重庆小面',
            '门框胡同百年卤煮',
            '青岛啤酒壹瓶好久精酿原浆鲜啤',
            '香肘居（京旺家园店）',
            '鱼豆吉豆浆鱼火锅（望京店）',
        ],
        '衣服': [
            '森马官方旗舰店',
        ],
        '娱乐': [
            '淘票票-电影'
            '淘票票-淘出好时光'
            '海战船',
            '朝阳公园',
            '深圳市迅雷网络技术有限公司',
        ],
        '生活缴费': [
            '国网北京市电力公司',
            '北京市自来水集团有限责任公司',
            '北京移动',
        ]
    },
    '网购': {
        '酒仙网': [
            '北京酒仙网络科技有限公司',
        ],
        '淘宝天猫微商': [
            '天猫超市',
            '白熊心品',
            '联联周边游',
        ],
        '快递': [
            '白鸽惠递',
            '顺丰速运',
        ]
    },
    '保险': {
        '保险': [
            '蚂蚁会员（北京）网络技术服务有限公司',
        ],
    },
    '出行': {
        '机票酒店': [
            '携程网',
        ],
        '公交地铁': [
            '北京轨道交通路网管理有限公司',
        ],
        '打车': [
            '滴滴出行',
        ],
        '共享单车': [
            '龙行单车俱乐部',
            '杭州青奇科技有限公司',
            '哈啰出行',
            '摩拜单车',
        ],
        '火车': [
            '中国铁路网络有限公司',
            '中国铁路总公司资金清算中心',
        ],
        '共享汽车': [
            'Gofun出行',
            '北京停简单信息技术有限公司',
            '北京首汽智行科技有限公司',
            '地坛停车场',
        ],
    },
    '学习': {
        '书籍资料': [
            '武汉金读科技有限公司',
            '知识星球',
            '阿里云',
        ],
        '证件资质': [
            '摩托驾校-龙先生',
            '学车不',
        ],
    },
    '医疗保险': {
        '体检': [
            '北京市顺义区空港医院',
            '北京爱康体检宝健康科技有限公司',
        ],
        '保险': [
            '保险云',
            '中国人民健康保险股份有限公司',
            '蚂蚁会员(北京)网络技术服务有限公司',
        ]
    },
    '父母': {
        '父母': [
            '皇额娘',
            '皇阿玛',
        ]
    }
}

free_charge_counterparty = {
    '北京停简单信息技术有限公司',
    '阿里云',
    '网商银行',
    '希望一直幸福下去',
    '北京林之雨铁板料理望京店',
    '北京丽都皇冠假日酒店',
    '北京东方银座百货',
    '剑(张剑)',
    '云武(张云武)',
    '大千食·融合料理',
    '北京林之雨铁板料理望京店',
    '北京丽都皇冠假日酒店',
    '周玖安',
    '内蒙四叔',
    '周博',
    '王义辉',
    '郭文元',
    '十一月小姐',
    '千牛刀·霸气牛肉锅',
    '高飞龙工商银行(6679)',
}