
counterparty_category = {
    '餐饮日用': {
        '超市菜场': [
            '*玉芳',
            '7-11(SEB)',
            'A  沿河小良',
            'A  小龙哥、',
            'wzg',
            'zhang',
            '万通五金百货',
            '万通果蔬大卖场',
            '万通果蔬大卖场京旺家园店',
            '世纪华联草场地店',
            '主食厨房',
            '冀喜荣',
            '北京便利蜂连锁商业有限公司',
            '华润超级市场有限公司',
            '华联生活超市京旺三区店',
            '叁金叁京旺店啤酒',
            '友宝售货机',
            '嘉华超市',
            '宋国强',
            '伴你一生',
            '全家幸福，爸妈健康长寿',
            '冬冬',
            '冷雨轩',
            '多点华北物美小程序',
            '戏如人生.',
            '海之心',
            '董文强',
            '宏',
            '宗海',
            '市场牛羊肉批发加工羊肉串',
            '平安快乐',
            '张',
            '快客便利店',
            '快客便利店国际电子城',
            '您好经典主食欢迎您',
            '我又改微信名啦',
            '李玉荣',
            '水果哥',
            '水果店',
            '沧州盐百',
            '沧州盐百购物广场有限公司',
            '海峰',
            '爱在明天',
            '玲玲',
            '福甜生鲜超市(京旺店)',
            '红薯地瓜坊',
            '胜利',
            '薛欣妍',
            '许浩',
            '谊品生鲜',
            '贾宝俊',
            '超市购物',
            '进口食品超市',
            '郭',
            '高荣玉',
            '魏志永',
            '鲸落',
            '麦果果',
            '👕王振海👕',
        ],
        '餐饮': [
            'luckincoffee瑞幸咖啡',
            '主食厨房',
            '乐家老铺食品旗舰店',
            '二愣子手擀面',
            '健力源-360餐厅',
            '北京盒马',
            '北京老诚一锅',
            '小舅',
            '山东大饼',
            '川渝香锅居东辛店店',
            '快客早餐国际电子城',
            '早阳鲜包北京朝阳酒仙桥路店',
            '陈记包子铺',
            '晋碗香',
            '森，森，森夜🌹',
            '海峰',
            '溢香阁',
            '红薯地瓜坊',
            '老店煎饼',
            '饿了么',
            '美团点评',
            '芳芳',
            '草场地二愣子手擀面',
            '西北汉子（京旺店）',
            '郑家老式熏鸡',
            '酒仙桥路7号黎家早阳鲜包店',
            '重庆小面',
            '门框胡同百年卤煮',
            '青岛啤酒壹瓶好久精酿原浆鲜啤',
            '香肘居（京旺家园店）',
            '鱼豆吉豆浆鱼火锅（望京店）',
        ],
        '衣服鞋包': [
            '森马官方旗舰店',
            '大东女鞋',
            '波司登羽绒服装有限公司',
        ],
        '娱乐': [
            '淘票票-电影',
            '淘票票-淘出好时光',
            '海战船',
            '朝阳公园',
            '深圳市迅雷网络技术有限公司',
        ],
        '生活缴费': [
            '国网北京市电力公司',
            '北京市自来水集团有限责任公司',
            '北京移动',
            '手机充值',
            '中国移动官方旗舰店',
            '中国移动官方旗舰店',
        ]
    },
    '网购': {
        '酒仙网': [
            '北京酒仙网络科技有限公司',
        ],
        '淘宝天猫微商': [
            '天猫超市',
            '白熊心品',
            '拼多多平台商户',
            '李俊豹@焕新',
            'HQG， Limited',
        ],
        '联联周边游': [
            '联联周边游',
        ],
        '快递': [
            '白鸽惠递',
            '顺丰速运',
        ]
    },
    '出行': {
        '机票酒店': [
            '携程网',
            '去哪儿网',
        ],
        '公交地铁': [
            '北京轨道交通路网管理有限公司',
        ],
        '打车': [
            '滴滴出行',
        ],
        '共享单车': [
            '龙行单车俱乐部',
            '北京摩拜科技有限公司',
            '杭州青奇科技有限公司',
            '哈啰出行',
            '摩拜单车',
        ],
        '火车': [
            '中国铁路网络有限公司',
            '中国铁路总公司资金清算中心',
        ],
        '共享汽车': [
            'Gofun出行',
            '北京停简单信息技术有限公司',
            '北京首汽智行科技有限公司',
            '北京市交通违法罚款代收银行',
            '地坛停车场',
            '车行易',
        ],
    },
    '学习': {
        '书籍资料': [
            '武汉金读科技有限公司',
            '知识星球',
            '阿里云',
        ],
        '证件资质': [
            '摩托驾校-龙先生',
            '麻琦',
            '学车不',
        ],
    },
    '医疗保险': {
        '医疗': [
            '首都医科大学附属北京地坛医院',
            '中国人民解放军第306医院',
        ],
        '体检': [
            '北京市顺义区空港医院',
            '北京爱康体检宝健康科技有限公司',
        ],
        '保险': [
            '保险云',
            '中国人民健康保险股份有限公司',
            '蚂蚁会员(北京)网络技术服务有限公司',
            '蚂蚁会员（北京）网络技术服务有限公司',
        ],
        '保健按摩': [
            '月亮（欢欢）',
        ]
    },
}

free_charge_trade_id = {
    '2019011722001441141013331711',
    '20190308200040011100830009994614',
    '20190307200040011100330003065708',
    '100005010119100700061215663661689408',
    '2019053022001443400568517816',
    '2019053022001443400564804814',
    '2019070922001441141042123481',
    '2019073122001441140532070041',
    '2019073122001441140531574951',
    '2019071822001441141044376774',
    '2019071022001441141042374219',
    '2019072722001441140598211217',
    '2019071822001441141044393928',
    '2019072722001441140501083205',
    '2019071122001441141042426277',
    '2019073122001441140533244486',
    '2019072722001441140599649515',
    '2019072722001441140597891148',
    '2019072622001411250539507037',
    '2019072722001441140500698346',
    '2019071822001441141044376775',
    '100005020119010900065312629993181620',     # 给媳妇发的红包
    '100003940119052000061215629465550408',     # 给媳妇发的红包
    '100003940119052000061215729479472408',     # 给媳妇发的红包
    '100003950119060400061215426898564408',     # 给媳妇发的红包
    '100003950119020500055211981162986408',     # 给媳妇发的红包
    '100003950119032600061214846635424408',     # 给媳妇发的红包
    '100003940119011200055211638706423408',     # 给媳妇发的红包
    '100003940119012000055212550171329408',     # 给媳妇发的红包
    '100003950119021300055213191970905408',     # 给媳妇发的红包
    '100003950119010300055212424139575408',     # 给媳妇发的红包
    '100003950119020500055212180518914408',     # 给媳妇发的红包
    '100003950119032600061213853508076408',     # 给媳妇发的红包
    '100003950119012500055213361151201408',     # 给媳妇发的红包
    '100003950119020200055213173224603408',     # 给媳妇发的红包
    '100003950119020500055213180099866408',     # 给媳妇发的红包
    '100003950119020500055213081105840408',     # 给媳妇发的红包
    '100003950119020500055212581158590408',     # 给媳妇发的红包
    '100003950119020500055213381130594408',     # 给媳妇发的红包
    '100003950119020500055213081171987408',     # 给媳妇发的红包
    '100003950119021200055213190571365408',     # 给媳妇发的红包
    '100003950119021500055212994265810408',     # 给媳妇发的红包
    '100003950119021500055212994266081408',     # 给媳妇发的红包
    '100003950119021500055212794266009408',     # 给媳妇发的红包
    '100003950119021500055211794323708408',     # 给媳妇发的红包
    '100003950119021500055212094295397408',     # 给媳妇发的红包
    '100003950119021500055211890207419408',     # 给媳妇发的红包

    # '4200000253201901153049415263',     # 我的保险
    # '4200000252201901147438180139',     # 我的保险
    # '4200000248201901156667173035',     # 我的保险
    # '2019020322001111251025331313',     # 我的保险

    '100005010119111100061215104169742408',
    '4200000455201911096821501473',
    '100005010119111600061215477023877408',
    '100005010119111600061215477012187408',
    '100005010119111600061211162648200408',
    '100005010119111600061215777139859408',
    '100010720119111600061211160017754408',
    '100010720119111600061215172794703408',
    '100010720119111600061211158219374408',
    '100010720119111600061215168697029408',
    '100003940119111600061215768333959408',
    '100003940119111500061215664402577408',
    '100010720119111500061215156723285408',
    '100010720119111500061215458192188408',
    '100010720119111500061215758281702408',
    '100005010119111500061215457351798408',
    '100010720119111500061215654034401408',
    '100010720119111400061211130187416408',
    '100010720119111400061215444465372408',
    '100010720119111400061215142860569408',
    '100004990119111400061215443887203408',

    '2019111022001311251412896865',
    '2019111022001311251413096110',

    '100005010119112600065311498705989620',
    '100005010119112700065311565664501620',
    '100005010119112900065311226061205620',
    '4200000458201911235339302531',
    '100004990119112500065312560024543620',
    '2019112622001411251420075957',



}

free_charge_counterparty = {
    '北京停简单信息技术有限公司',
    '阿里云',
    '网商银行',
    '希望一直幸福下去',
    '北京林之雨铁板料理望京店',
    '北京丽都皇冠假日酒店',
    '北京东方银座百货',
    '剑(张剑)',
    '云武(张云武)',
    '大千食·融合料理',
    '北京林之雨铁板料理望京店',
    '北京丽都皇冠假日酒店',
    '周玖安',
    '内蒙四叔',
    '周博',
    '王义辉',
    '郭文元',
    '十一月先生',
    '十一月小姐',
    '千牛刀·霸气牛肉锅',
    '高飞龙工商银行(6679)',

    '姜泽才',
    '阿妈',
    '任建民',
    '小弟',

    '北京尚客电影主题KTV',
}

header_zfb_in_common = {
    '姓名': '姓名',
    '支付通道': '支付通道',
    '交易创建时间': '交易时间',
    '主类别': '主类别',
    '子类别': '子类别',
    '交易对方': '交易对方',
    '商品名称': '商品名称',
    '金额（元）': '金额',
    '收/支': '收支',
    '交易号': '订单ID',
    '类型': '交易类型',
    '交易状态': '交易状态',
    # 商家订单号,
    # 付款时间,
    # 最近修改时间,
    # 交易来源地,
    # 服务费（元）,
    # 成功退款（元）,
    # 备注,
    # 资金状态,
}


header_wx_in_common = {
    '姓名': '姓名',
    '支付通道': '支付通道',
    '交易时间': '交易时间',
    '主类别': '主类别',
    '子类别': '子类别',
    '交易对方': '交易对方',
    '商品': '商品名称',
    '金额(元)': '金额',
    '收/支': '收支',
    '交易单号': '订单ID',
    '交易类型': '交易类型',
    '当前状态': '交易状态',
    # 支付方式
    # 商户单号
}

income_whitelist_gfl = {
    '*枞林',
    '幸福安康',
    '剑',
    '磊',
    '李勇',
    '高翔',
    '皇阿玛',
    '希望一直幸福下去',
}

income_whitelist_gfl = {
    '姜泽才',
    '十一月先生',
    '高飞龙',
    '柠檬',
    '阿妈',
}